{
  "id": "701",
  "name": "The Nuclear-Free Network State: Web3 and Nuclear Disarmament",
  "description": "<p><u><strong>Workshop description</strong></u><br>\n</p>\n<p>Nuclear weapons are an immediate, existential threat to humanity, and nuclear war is becoming more likely – including because <a href=\"https://www.researchgate.net/publication/342218606_Artificial_Intelligence_in_Nuclear_Warfare_A_Perfect_Storm_of_Instability\"><u>AI could undermine nuclear deterrence.</u></a><u> </u>&nbsp;Thousands of Russian and US nuclear missiles are ready to launch within half an hour and would start hitting their targets 30-45 minutes later. As well as killing hundreds of millions of people within hours, the <a href=\"https://www.vox.com/future-perfect/2022/8/17/23306861/nuclear-winter-war-climate-change-food-starvation-existential-risk-russia-united-states\"><u>climate impacts of a nuclear war could kill 5 billion</u></a><u> people</u> worldwide <em>from starvation alone</em>. <a href=\"https://pathcollective.org\"><u>PATH Collective</u></a> &nbsp;believes Web3 communities can help to address this existential threat.</p>\n<p><br></p>\n<p>The problem is that <a href=\"https://3ba8a190-62da-4c98-86d2-893079d87083.usrfiles.com/ugd/3ba8a1_3ad999bcc8ff4a289f985db52bb88196.pdf\"><u>making nuclear weapons is&nbsp;very profitable</u></a>. Part of the solution is therefore to make peace profitable, using decentralized security (DeSec) mechanisms to incentivize cooperation on nuclear threat reduction. Join PATH Collective for this discussion on how Web3’s decentralized social, financial, and governance tools could be used to create agency for citizens to help address nuclear and other existential threats, and to incentivize cooperation on these issues by making it profitable.</p>\n<p><br></p>\n<p><u><strong>Workshop facilitator</strong></u><br>\n</p>\n<p><a href=\"https://www.kcl.ac.uk/people/dr-lyndon-burford\"><u>Dr Lyndon Burford</u></a> &nbsp;is a nuclear weapons policy specialist and co-founder of PATH Collective, a startup working at the intersection of Web3 and humanitarian approaches to nuclear disarmament. PATH is working to bridge the Web3 and disarmament worlds, and to develop solutions that combine environmental monitoring with the decentralized finance and governance of Web3. The aim is to make phased, verified nuclear disarmament both possible and profitable.</p>\n<p>This event is part of the AI x Crypto Summit @ Zuzalu! Please see <a href=\"http://ai.zuzalu.ai/\" title=\"ai.zuzalu.ai\"><u>ai.zuzalu.ai</u></a> for full details.</p>",
  "track": "AI x Crypto",
  "stage": { "id": "Board Room", "name": "Board Room", "stream": [{ "id": "fe9970f6-1dee-40e1-8e9f-5bc99fed7dec" }] },
  "start": 1683284400000,
  "end": 1683288000000,
  "speakers": [{ "id": "Yesh Odharab", "name": "Yesh Odharab" }]
}
