{
  "id": "737",
  "name": "Decentralized Brand Building Figjam",
  "description": "<p>Decentralized Brand building coordination: Building Brands in ZK, on-chain Gaming, Fashion apparel, Public Goods, and Longevity projects</p>\n<p><br></p>\n<p>Event Description:</p>\n<p>Welcome to United by Innovation, a groundbreaking event that aims to build powerful brands around zero-knowledge (ZK) projects, game development, fashion apparels, public goods initiatives, and longevity research. Join us as we use FigJam, a versatile online whiteboard tool, to brainstorm, collaborate, and co-create transformative brands that will shape the future of these industries.</p>\n<p><br></p>\n<p>This interactive session will harness the power of FigJam to facilitate seamless ideation and collaboration among participants. To ensure a fair and transparent contribution tracking process, we will use TaggieLab, a state-of-the-art tool designed to record and measure individual inputs in real-time.</p>\n<p><br></p>\n<p>As we come together to create brands that resonate with audiences across diverse fields, we'll explore the unique challenges and opportunities presented by each industry. From harnessing the power of ZK protocols to revolutionizing gaming experiences, making strides in longevity research, crafting sustainable fashion apparel, and driving positive change through public goods projects, our collective creativity will lay the foundation for groundbreaking innovation.</p>\n<p><br></p>\n<p>Don't miss this chance to unite with like-minded visionaries and contribute to the development of brands that will leave a lasting impact. Sign up now for United by Innovation and be part of the creative force that will shape the future of these exciting fields. Embrace the power of collaboration and let's build brands that make a difference!</p>",
  "track": "Open Sessions",
  "stage": { "id": "Board Room", "name": "Board Room", "stream": [{ "id": "fe9970f6-1dee-40e1-8e9f-5bc99fed7dec" }] },
  "start": 1683543600000,
  "end": 1683547200000,
  "speakers": [
    { "id": "Julie Zhang", "name": "Julie Zhang" },
    { "id": "Rachel Akerley", "name": "Rachel Akerley" },
    { "id": "Olivia Lee", "name": "Olivia Lee" },
    { "id": "Io Qu", "name": "Io Qu" },
    { "id": "Anton Kulaga", "name": "Anton Kulaga" },
    { "id": "Joey Langenbrunner", "name": "Joey Langenbrunner" }
  ]
}
