{"id":"354","name":"Embodiment Weekend - Opening Ceremony ","description":"<p><strong>LilaB - Laboratory of Embodiment and Movement: </strong>A wild combination of yoga techniques, movement research and ecstatic practices.<br>\n</p>\n<p>Welcome are so excited to announce the upcoming embodiment workshop, LilaB, a laboratory of embodiment and movement.<br>\nThis is designed for people of all backgrounds, age, gender identity and experience levels.&nbsp;</p>\n<p>Embodiment is the practice of exploring the connection between your body and mind. It's about bringing your attention to your physical sensations, emotions, and movements, and using them to deepen your understanding of yourself and your interactions with others.&nbsp;</p>\n<p>In these workshops, you will have the opportunity to learn about embodiment through a variety of exercises and activities over a period of 4 days, held at Zuzalu. We will guide you through practices such as breathwork, movement, meditation, and mindfulness, all of which are designed to help you tune in to your body and cultivate awareness.<br>\n</p>\n<p>We hope that if you join, you commit to the entire experience - from opening ceremony to closing ceremony. Growth happens best in community, ritual, vulnerability, depth and practice and there will be people who are trained to hold you in your deepest moments. Moving your body can bring up emotions that have been suppressed, and finally give them expression. Express and release. We all have pent up emotions. You are not alone. These emotions deserve to be expressed, they deserve to have a voice and a movement, and ohhhh does it feel good. &nbsp;<br>\n</p>\n<p>No prior experience is required, and we welcome individuals of all levels of fitness and ability. Our facilitators will be on hand to offer guidance and support throughout the workshop.</p>\n<p>Come join us and explore the fascinating world of embodiment!</p>\n<p><br></p>\n<p><a href=\"https://zuzalu.notion.site/zuzalu/LilaB-Laboratory-of-Embodiment-and-Movement-8a85ac76ea67431eb1205fa57fde40ba\">Embodiment Workshop</a><br>\n&nbsp;</p>","track":"Other","stage":{"id":"0","name":"Unknown","stream":[{"id":""}]},"start":1682062200000,"end":1682069400000,"speakers":[{"id":"ilana brown","name":"ilana brown"},{"id":"Marijana Lemm","name":"Marijana Lemm"},{"id":"Giulia Anna Maria","name":"Giulia Anna Maria"}]}