{
  "id": "630",
  "name": "[Round-Table Discussion] Meta-verse Mavericks #1 - The Future of AI in Web3 and Beyond",
  "description": "<p><br></p>\n<figure><img src=\"https://pbs.twimg.com/media/FqrKU3SX0AELeXu?format=jpg&amp;name=large\" height=\"auto\" width=\"auto\"/></figure>\n<p><br></p>\n<p><br></p>\n<p>Artificial Intelligence has been spinning the world on its head. While some speculate that AGI has already arrived, thought leaders in the field have taken a more nuanced stance.<br>\n</p>\n<p><br></p>\n<p>Whether or not the world will soon be dominated by flying, crawling, swimming, shapeshifting - autonomous intelligent terminator robots…<br>\n</p>\n<p><br></p>\n<p>Queena Tsai [ Co-Founder rct AI // Forbes 30U30 ] and Yannick Myson [ Brand Lead @ Delysium &amp; Lucy-AI ] would like to invite the movers and shakers in AI x Crypto to a free-for-all round table discussion.<br>\n</p>\n<p><br></p>\n<p>For the past 4 years, we’ve been building AI-powered tools that help shape the foundational building blocks of the Meta-verse.<br>\n</p>\n<p><br></p>\n<p>Our backers, like Y-Combinator and Makers Fund, have graciously contributed to the swift development of our award-winning products.<br>\n</p>\n<p><br></p>\n<figure><img src=\"https://pbs.twimg.com/media/FqS_hxBaEAAk9KU?format=jpg&amp;name=medium\" height=\"auto\" width=\"auto\"/></figure>\n<p><br></p>\n<p>The most recent edition to our Delysium’s multiverse is Lucy OS.</p>\n<p><br></p>\n<p><br></p>\n<p>Lucy is an AI-powered Web3 virtual assistant that can help you learn about the latest projects, manage your assets and perform transactions without the hassle.</p>\n<p><br></p>\n<p><br></p>\n<p>Within the first 20 days after launch, Lucy’s user base grew to over 1.2 million. This has demonstrated the bullish perspective the Web3 space has on AI.</p>\n<p><br></p>\n<p><br></p>\n<p>As we quickly travel through the elbow curve of technological advancement, our decisions become increasingly important.</p>\n<p><br></p>\n<p><br></p>\n<p>We wish to leave a lasting positive impact on the world.</p>\n<p><br></p>\n<p><br></p>\n<p>This first edition of Meta-verse Mavericks is a light-hearted initiative to bring together the right minds:</p>\n<p><br></p>\n<p><br></p>\n<p>Together we’ll embark on a journey into the depths of our fields, exploring the exciting new frontiers of AI in Web3, the Meta-verse, and beyond.</p>\n<p><br></p>\n<p><br></p>\n<p>We want to create lasting serendipitous encounters that spark new ideas and collaborations that help society navigate this new ocean of opportunity.</p>\n<p><br></p>\n<p><br></p>\n<p>If you’re active in building Web3, AI, Meta-verse, or anything in the direction thereof, you’re most welcome to join us.</p>\n<p><br></p>\n<p><a href=\"https://twitter.com/The_Delysium\">Delysium Twitter</a>&nbsp;</p>\n<p><a href=\"https://chat.delysium.com/\">Chat with Lucy</a>&nbsp;</p>\n<p><a href=\"https://rct.ai/en-us/\">rct AI</a>&nbsp;</p>",
  "track": "AI x Crypto",
  "stage": { "id": "Kiki’s Restaurant outside", "name": "Kiki’s Restaurant outside" },
  "start": 1683288900000,
  "end": 1683292500000,
  "speakers": [
    { "id": "Xinyi Cai", "name": "Xinyi Cai" },
    { "id": "alen zhang", "name": "alen zhang" }
  ]
}
