{
    "version": 1,
    "name": "Solidity Summit",
    "description": "Solidity ecosystem day for people involved and interested in the Solidity language and the ecosystem around it. It features talks & discussions on Solidity, Yul, language design and tooling.",
    "start": "2022-04-20",
    "end": "2022-04-20",
    "website": "https://summit.soliditylang.org/",
    "poster": "/posters/solidity-summit.jpg",
    "stream": {
        "version": 1
    },
    "archive": {
      "version": 1,
      "type": "ipfs",
      "config": {
        "directory": "QmT2qgRvx6LzyCzfTeHux8ZvoH8L28YK2yz6PgAywbMHdk"
      }    
    },
    "schedule": {
        "sessions": [
            {
                "id": "1",
                "name": "Opening & Welcome",
                "start": "2022-04-20T10:00:00.000Z",
                "end": "2022-04-20T10:10:00.000Z",
                "abstract": "We welcome you to the Solidity Summit, give and overview of the content of day, the venue, and everything else you need to know.",
                "type": "Talk",
                "room": "Main",
                "speakers": [
                    {
                        "id": "franziska-heintel",
                        "name": "Franziska Heintel",
                        "role": "Solidity Team, Ethereum Foundation"
                    }
                ]
            },
            {
                "id": "2",
                "name": "Solidity in 2022: Recent and Planned Features",
                "start": "2022-04-20T10:10:00.000Z",
                "end": "2022-04-20T10:45:00.000Z",
                "abstract": "In the recent months, Solidity has introduced several exciting features that make it more flexible and safer at the same time, without compromising on performance. I would like to show you some examples of what is possible with the latest version of Solidity and explain some reasoning behind the features. The improvements do not stop there, though: We want to allow you to write generic code, improve the memory management and extract as much \"magical code\" from the compiler into a generic library as possible.",
                "type": "Talk",
                "room": "Main",
                "speakers": [
                    {
                        "id": "christian-reitwiessner",
                        "name": "Christian Reitwiessner",
                        "role": "Solidity Team, Ethereum Foundation"
                    }
                ]
            },
            {
                "id": "3",
                "name": "Thanks for all the bugs!",
                "start": "2022-04-20T10:45:00.000Z",
                "end": "2022-04-20T11:10:00.000Z",
                "abstract": "In the past year, we (Dedaub) have disclosed numerous vulnerabilities in deployed smart contracts and received 8 significant bug bounties totaling over $2.5M. The talk derives from this experience: I'll talk about the Dedaub tooling (including the contract-library.com code explorer) and a couple of Solidity patterns that have been behind high-value vulnerabilities we've identified. The main body of the talk, however, will focus on a simple question: \"what can I do as a developer to make my smart contract auditor more efficient and effective?\" This is not much different from asking \"how can I write better code?\" but I intend to give actionable advice, based on numerous audits (and instances of hair pulling).",
                "type": "Talk",
                "room": "Main",
                "speakers": [
                    {
                        "id": "yannis-smaragdakis",
                        "name": "Yannis Smaragdakis",
                        "role": "Dedaub"
                    }
                ]
            },
            {
                "id": "4",
                "name": "Good practices from a Data Analyst perspective",
                "start": "2022-04-20T11:10:00.000Z",
                "end": "2022-04-20T11:40:00.000Z",
                "abstract": "Make an approach to good practices on events emission, to introduce to Sol developers an idea on how to model the event database so that the information is available for posterior data analysts. I see a lot of gas saving discussions, and none on good data practices, as well as very few clean data dashboards, because of hacky implementations.",
                "type": "Talk",
                "room": "Main",
                "speakers": [
                    {
                        "id": "wei3erhase",
                        "name": "wei3erhase",
                        "role": "DeFi Wonderland"
                    }
                ]
            },
            {
                "id": "5",
                "name": "Mocking of internal functions in Solidity Unit Tests",
                "start": "2022-04-20T11:40:00.000Z",
                "end": "2022-04-20T11:55:00.000Z",
                "abstract": "The smart contracts for float.capital make use of lots of small, inter-dependent, internal functions.\n\nThe best solution we could find to solve these issues at the time was smock (which is probably still the best option), however this only allows mocking of external functions.\n\nAs a solution to this, we built a code-generation tool that built out modified smart contracts that externalised all internal functions to call out to an external contract so that we can selectively turn on mocking for any internal function and use smock on any internal function. All this code was generated by looking at the AST, abi and contract code in the code-gen process. We are currently in the process of experimenting with how we can use similar techniques in forge/foundry contract testing.",
                "type": "Talk",
                "room": "Main",
                "speakers": [
                    {
                        "id": "jason-smythe",
                        "name": "Jason Smythe",
                        "role": "Float Capital"
                    }
                ]
            },
            {
                "id": "6",
                "name": "Create 2 patterns",
                "start": "2022-04-20T11:55:00.000Z",
                "end": "2022-04-20T12:10:00.000Z",
                "abstract": "I would enjoy talking about various interesting things you can do using `create2`. That goes all the way from proxies that don't need to explicitly store owners, to crosschain address oracles and fancy bridge escrowing systems.\nI want to highlight a couple of these different approaches and how they are used in deployed applications.",
                "type": "Talk",
                "room": "Main",
                "speakers": [
                    {
                        "id": "fred",
                        "name": "Fred",
                        "role": "Offchain Labs building Arbitrum"
                    }
                ]
            },
            {
                "id": "7",
                "name": "Foundry 101, a hands-on introduction",
                "start": "2022-04-20T12:30:00.000Z",
                "end": "2022-04-20T13:50:00.000Z",
                "abstract": "We will go through examples of using Foundry in the real-world™️ and also see how we can easily migrate existing testing suites to Foundry.",
                "type": "Talk",
                "room": "Main",
                "speakers": [
                    {
                        "id": "odysseas",
                        "name": "odysseas",
                        "role": "Nomad"
                    }
                ]
            },
            {
                "id": "8",
                "name": "dΞth Crypto",
                "start": "2022-04-20T13:50:00.000Z",
                "end": "2022-04-20T14:05:00.000Z",
                "abstract": "At DethCrypto we are working on dev tooling for crypto. You might have used typechain, eth-sdk, earl or deth code. I would briefly go through those tools and then talk about the Solidity profiling service we are building and unique features it will provide.",
                "type": "Talk",
                "room": "Main",
                "speakers": [
                    {
                        "id": "leo-logvinov",
                        "name": "Leo Logvinov",
                        "role": "DethCrypto"
                    }
                ]
            },
            {
                "id": "9",
                "name": "Remix Hybrid Tools",
                "start": "2022-04-20T14:05:00.000Z",
                "end": "2022-04-20T14:20:00.000Z",
                "abstract": "Remix Hybrid tools to help drafting and developing dapps.",
                "type": "Talk",
                "room": "Main",
                "speakers": [
                    {
                        "id": "aniket",
                        "name": "Aniket",
                        "role": "Remix Team, Ethereum Foundation"
                    }
                ]
            },
            {
                "id": "10",
                "name": "Presenting @truffle/decoder",
                "start": "2022-04-20T14:20:00.000Z",
                "end": "2022-04-20T14:45:00.000Z",
                "abstract": "Truffle's ultra-powerful @truffle/decoder package, a high-level interface for decoding transactions, events, and state variables for Ethereum smart contracts.",
                "type": "Talk",
                "room": "Main",
                "speakers": [
                    {
                        "id": "g-nicholas-dandrea",
                        "name": "G. Nicholas D'Andrea",
                        "role": "Truffle"
                    }
                ]
            },
            {
                "id": "11",
                "name": "Human-Friendly Contract Interactions with Sourcify Verification",
                "start": "2022-04-20T14:45:00.000Z",
                "end": "2022-04-20T15:00:00.000Z",
                "abstract": "Goodbye YOLO-Signing! Sourcify's source code verification via contract metadata enables human-friendly contract interactions and provides byte-by-byte (perfect) matches of the deployed contract. The talk encompasses how perfect matches work, how can you use Sourcify, and what Sourcify's vision for better contract interactions is.",
                "type": "Talk",
                "room": "Main",
                "speakers": [
                    {
                        "id": "kaan-uzdogan",
                        "name": "Kaan Uzdogan",
                        "role": "Sourcify Team, Ethereum Foundation"
                    }
                ]
            },
            {
                "id": "12",
                "name": "Hybrid Attack Synthesis for DeFi",
                "start": "2022-04-20T15:00:00.000Z",
                "end": "2022-04-20T15:15:00.000Z",
                "abstract": "We present two open-source analysis tools developed by Veridise, a new software auditing company for smart contracts. First, Vanguard is the first cross-chain tool that finds vulnerabilities in smart contracts by looking for common patterns. Second,  Eurus, uses symbolic execution to discover vulnerabilities in smart contracts. Unlike other analysis tools both Vanguard and Eurus provide users with concrete evidence of exploitability. In this talk, we showcase the functionality of these tools and examine how they can automatically generate complex attacks on smart contracts such as flashloan attacks.",
                "type": "Talk",
                "room": "Main",
                "speakers": [
                    {
                        "id": "jon-stephens",
                        "name": "Jon Stephens",
                        "role": "Veridise"
                    }
                ]
            },
            {
                "id": "13",
                "name": "PRBMath: A Smart Contract Library for Fixed-Point Math",
                "start": "2022-04-20T15:15:00.000Z",
                "end": "2022-04-20T15:30:00.000Z",
                "abstract": "What PRBMath is needed for and the most popular use cases",
                "type": "Talk",
                "room": "Main",
                "speakers": [
                    {
                        "id": "paul-razvan-berg",
                        "name": "Paul Razvan Berg",
                        "role": "Sablier"
                    }
                ]
            },
            {
                "id": "14",
                "name": "IntelliJ Solidity Debugger",
                "start": "2022-04-20T15:30:00.000Z",
                "end": "2022-04-20T16:00:00.000Z",
                "abstract": "We've been working on a Solidity debugger for IntelliJ this past few months and we'd like to demo it.",
                "type": "Talk",
                "room": "Main",
                "speakers": [
                    {
                        "id": "conor-svensson",
                        "name": "Conor Svensson",
                        "role": "Web3 Labs"
                    }
                ]
            },
            {
                "id": "15",
                "name": "What would Solidity look like if it was built today?",
                "start": "2022-04-20T16:00:00.000Z",
                "end": "2022-04-20T16:15:00.000Z",
                "abstract": "Exploring how Solidity would look like if it were designed today, with everything we know about both language development and smart contract development. Including, but not limited to: tooling, zero-cost abstractions, type system, etc. These features can even be added to Solidity in the future if there is demand!",
                "type": "Talk",
                "room": "Main",
                "speakers": [
                    {
                        "id": "john-adler",
                        "name": "John Adler",
                        "role": "Fuel Labs"
                    }
                ]
            },
            {
                "id": "16",
                "name": "Bootstrapping a Compiler with Yul",
                "start": "2022-04-20T16:15:00.000Z",
                "end": "2022-04-20T16:40:00.000Z",
                "abstract": "An overview of how Yul has been used in Fe's development. We will discuss how we use Yul to generate bytecode for a high-level language and go over the Rust tooling that assists us.",
                "type": "Talk",
                "room": "Main",
                "speakers": [
                    {
                        "id": "grant-wuerker",
                        "name": "Grant Wuerker",
                        "role": "Fe Team, Ethereum Foundation"
                    }
                ]
            },
            {
                "id": "17",
                "name": "The Solidity Optimizooooor",
                "start": "2022-04-20T16:40:00.000Z",
                "end": "2022-04-20T17:05:00.000Z",
                "abstract": "There is a lot of mystery behind the Solidity optimizer. Understanding the optimizer would allow one to write contracts that are readable while also being gas efficient. This is especially important for the ``viaIR`` pipeline as it enables the compiler to perform complex optimizations. The talk will give an overview of some optimization steps, with a focus on how it affects real world code!",
                "type": "Talk",
                "room": "Main",
                "speakers": [
                    {
                        "id": "hari-mulackal",
                        "name": "Hari Mulackal",
                        "role": "Solidity Team, Ethereum Foundation"
                    }
                ]
            },
            {
                "id": "18",
                "name": "Generating EVM bytecode from Yul in the new via-IR pipeline",
                "start": "2022-04-20T17:05:00.000Z",
                "end": "2022-04-20T17:30:00.000Z",
                "abstract": "While Yul is a low-level language that provides only a thin abstraction over the bare opcodes of the EVM, the transition from Yul to EVM bytecode still leaves room for certain choices: most obviously the control-flow structures of Yul have to be translated to plain jumps in the EVM. But furthermore, Yul does not presuppose the layout of its variables on the EVM's stack - and due to the fact that the EVM merely allows access to the 16 top-most values on its stack, the precise construction of suitable stack layouts and transitions between them is particularly important.\nIn this talk, I will sketch the inner workings of the Yul-to-EVM code transform used in the new via-IR compilation pipeline with enabled optimizer. I will discuss its advantages over the more naive approach used for Yul components in the legacy compiler pipeline, how it interacts with the Yul optimizer to move variables from stack to memory to avoid stack-too-deep errors and what further improvements can be expected in the near future. Lastly, I will hint at the challenges this new mechanism presents for tooling and debuggers.",
                "type": "Talk",
                "room": "Main",
                "speakers": [
                    {
                        "id": "daniel-kirchner",
                        "name": "Daniel Kirchner",
                        "role": "Solidity Team, Ethereum Foundation"
                    }
                ]
            },
            {
                "id": "19",
                "name": "Underhanded Solidity Contest Winner Presentations",
                "start": "2022-04-20T17:30:00.000Z",
                "end": "2022-04-20T18:00:00.000Z",
                "abstract": "The winners of this year's Underhanded Solidity Contest will present their submissions.",
                "type": "Talk",
                "room": "Main",
                "speakers": [
                    {
                        "id": "tynan-richards",
                        "name": "Tynan Richards",
                        "role": "ChainSecurity",
                        "description": ""
                    },
                    {
                        "id": "santiago-palladino",
                        "name": "Santiago Palladino",
                        "role": "OpenZeppelin",
                        "description": ""
                    },
                    {
                        "id": "michael-zhu",
                        "name": "Michael Zhu",
                        "role": "0xProject"
                    }
                ]
            }
        ]
    },
    "rooms": [
        {
            "id": "Main",
            "streams": [
                {
                    "id": "3a9f94d8-71f8-47a1-91b9-c18667e61d50"
                },
                {
                    "id": "63e61159-51e4-485c-a44e-edaaebf9e225"
                }
            ]
        }
    ],
    "recordings": [
        {
            "name": "Main",
            "recordingUrl": "https://livepeercdn.com/recordings/3a9fe6fc-b76d-497e-9656-64eebb095061/index.m3u8"
        }
    ]
}